---
kind: type
id: T:Autodesk.Revit.DB.AssemblyMemberDifferentGeometry
source: html/6183660b-931b-7711-6489-1a4aef4cf308.htm
---
# Autodesk.Revit.DB.AssemblyMemberDifferentGeometry

The two assembly members being compared have different geometry

## Syntax (C#)
```csharp
public class AssemblyMemberDifferentGeometry : AssemblyMemberDifference
```